#include "use_lib.h"
#include "solutions.h"

using namespace std;

int main() {
    setlocaleUTF8();

    // ********************** Решение №1 *********************
    // доступные команды:
    // add: добавить в корзину товар (количество)
    // list: просмотр товаров в корзине
    // remove: удаление товаров из корзины
    // *******************************************************
    //solution_1();

    // ********************** Решение №2 *********************
    //solution_2();

    solution_3();

    return 0;
}
